
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

//	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара"); АСИНХ 
//
//	Если ПроверитьТовар(НазваниеТовара) Тогда
//		ТекстСообщения = СтрШаблон("Товар %1 найден", НазваниеТовара);
//	Иначе
//		ТекстСообщения = СтрШаблон("Товар %1 не найден", НазваниеТовара);
//	КонецЕсли;
//
//	Сообщить(ТекстСообщения);


КонецПроцедуры


Функция ПроверитьТовар(НазваниеТовара)

	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;	

КонецФункции