
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если не ВебКлиент Тогда
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьТовар(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
	#Иначе
	#КонецЕсли

КонецПроцедуры


&НаСервере
Функция ПроверитьТовар(НазваниеТовара)

	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;	

КонецФункции